[
  {
    "doc": "https://text.npr.org/nx-s1-5384958",
    "chunk": "Text-Only Version [Go To Full Site](https://www.npr.org/nx-s1-5384958) [NPR](/) > [Business](/1006) # Warren Buffett announces his retirement and warns the trade war will hurt America By Maria Aspan Saturday, May 3, 2025 • 2:27 PM EDT Heard on [Weekend Edition Sunday](/nx-s1-5357056/2025-05-04) OMAHA, Neb.–Warren Buffett wants the United States to knock off its [trade war](/2025/05/02/nx-s1-5383289/jobs-employment-labor-economy-recession-tariffs). \"Trade should not be a weapon,\" the billionaire investor and Berkshire Hathaway CEO said on Saturday morning, at his annual shareholder meeting in Omaha. The United States \"should be looking to trade with the rest of the world. We should do what we do best, and they should do what they do best,\" Buffett told the crowd of thousands in a downtown arena, who broke out into applause. Buffett did not mention President Trump, whose sweeping new tariffs have ignited a global trade war, [roiled financial markets](/2025/04/21/nx-s1-5361202/trump-tariffs-dollar-china-wall-street-bonds), and sounded wide-ranging alarms about a [recession](/2025/04/30/nx-s1-5380204/trump-economy-gdp-tariffs-recession-consumers). But his rebuke of Trump's policies answered one of Wall Street's biggest questions of this weekend: Would Buffett weigh in on the trade war and its massive disruptions? Many of those attending this [\"Woodstock for Capitalists,\"](/2011/04/29/135829351/warren-buffet-hosts-woodstock-for-capitalists) which draws [tens of thousands](https://www.reuters.com/business/warren-buffett-berkshire-hathaway-glance-2025-05-03/) of people from around the world, told NPR they were waiting for Buffett to speak out on the tariffs. Buffett, 94, also closed the event with major news, announcing that he would be stepping down as CEO at the end of the year, in favor of his long-designated successor, Greg Abel. He received a prolonged standing ovation from the audience in Omaha's CHI Health Center. \"The enthusiasm from that",
    "chunk_id": "url_ad2a32ce_0"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384958",
    "chunk": "that he would be stepping down as CEO at the end of the year, in favor of his long-designated successor, Greg Abel. He received a prolonged standing ovation from the audience in Omaha's CHI Health Center. \"The enthusiasm from that response can be interpreted in two ways,\" he quipped as he left the stage. The Berkshire Hathaway CEO has been largely silent on trade this spring, as [some of his peers](/2025/04/12/nx-s1-5361177/for-ceos-unknown-and-uncertainty-are-the-words-of-the-hour-with-tariffs) have cautiously started [criticizing](/2025/03/14/nx-s1-5327534/trump-ceos-tariffs-economy-recession) the tariffs' impact on the global economy — and their businesses. Buffett \"has got to be frustrated by what's going on in Washington, for no other reason than it has injected a degree of uncertainty into his business,\" says Cathy Seifert, an analyst who covers Berkshire for CFRA Research. Now many of the [largest U.S. companies](/2025/04/25/nx-s1-5375820/big-brands-tariffs-us-spending-consumers) are cutting or [withdrawing](https://www.wsj.com/business/earnings/earnings-trade-war-uncertainty-88edd369) their financial forecasts for this year, citing the tariffs. Berkshire added to the warnings on Saturday morning, as it [reported](https://berkshirehathaway.com/qtrly/1stqtr25.pdf) a sharp drop in quarterly profit from a year earlier. The company said it can't currently predict the tariffs' impact on its vast array of businesses and investments, but \"it is reasonably possible there could be adverse consequences.\" ### Buffett uses his bully pulpit to advocate for America At age 94, Buffett wields a tremendous amount of power on Wall Street and beyond. He bought Berkshire Hathaway in 1965, when it was a struggling textile mill. Sixty years later, it's one of the largest companies [in the world](https://fortune.com/ranking/global500/2024/), operating businesses ranging from insurance and railroads to Dairy Queen and Duracell batteries.",
    "chunk_id": "url_ad2a32ce_1"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384958",
    "chunk": "and beyond. He bought Berkshire Hathaway in 1965, when it was a struggling textile mill. Sixty years later, it's one of the largest companies [in the world](https://fortune.com/ranking/global500/2024/), operating businesses ranging from insurance and railroads to Dairy Queen and Duracell batteries. It's also a powerful investor in other companies, owning shares in Coca-Cola, Apple, American Express, and other big businesses. \"Because of its breadth and its depth … it really is sort of a microcosm for the broader economy,\" Seifert says. The Omaha-born Buffett is famously folksy and tends to wrap himself in the American flag, [regularly praising](https://www.berkshirehathaway.com/letters/2024ltr.pdf) both his country and its systems. \"The luckiest day in the world is the day I was born. I was born in the United States,\" he said on Saturday. So he framed his opposition to tariffs, in part, as a matter of national security for the U.S. and its citizens. \"The more prosperous the rest of the world becomes … the more prosperous we'll become, and the safer we'll feel and your children will feel someday,\" he said, to more applause. ### Buffett turns rote corporate event into \"Woodstock for Capitalists\" Buffettspoke for more than four hours on Saturday, in a decades-old tradition that's unlike any other investor meeting in corporate America. Most of these events are tedious, rote, and often virtual. But Berkshire and its CEO have turned its annual meeting into a party weekend in Omaha. In person, the feeling is part fan convention, part quasi-religious revival, and part pop-up outlet mall. Buffett said that on Friday,",
    "chunk_id": "url_ad2a32ce_2"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384958",
    "chunk": "and often virtual. But Berkshire and its CEO have turned its annual meeting into a party weekend in Omaha. In person, the feeling is part fan convention, part quasi-religious revival, and part pop-up outlet mall. Buffett said that on Friday, [almost 20,000 people](https://www.cnbc.com/2025/05/03/warren-buffett-at-the-berkshire-hathaway-annual-meeting-2025-live-updates.html) visited the CHI Health Center's exhibit hall, full of displays — and shops — devoted to Berkshire-owned brands. Many emerged with bulging shopping bags full of See's Candies, Fruit of the Loom underwear, and plush \"Squishmallow\" toys [modeled after Buffett](https://www.cnbc.com/2025/05/02/berkshire-meeting-bazaar-features-buffett-squishmallows-60th-anniversary-book-and-giant-claw-machine.html) and his late business partner, [Charlie Munger](/2023/11/28/1215694835/influential-investor-charlie-munger-longtime-friend-of-warren-buffett-has-died). Finance bros in vests crowded past young families with strollers, foreign travelers taking selfies with gigantic Berkshire signs, and retirees who told an NPR reporter they've owned Berkshire shares for decades. \"I told my kids: Do not sell it,\" said Lorenzo Alaan, a retired physician who traveled to Omaha from The Villages, Florida. \"You sell your house, your jewelry, don't sell Berkshire,\" he added. \"It's for your children and grandchildren.\" Topics * [News](/1001) * [Culture](/1008) * [Music](/1039) - [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_ad2a32ce_3"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5386457",
    "chunk": "Text-Only Version [Go To Full Site](https://www.npr.org/nx-s1-5386457) [NPR](/) > [World](/1004) # Lady Gaga rocks Copacabana Beach with a free concert for more than 2 million fans By The Associated Press Sunday, May 4, 2025 • 5:11 AM EDT RIO DE JANEIRO — Lady Gaga gave a free concert Saturday night in front of 2 million fans who poured onto Copacabana Beach for the biggest show of her career. \"Tonight, we're making history. (...) Thank you for making history with me,\" Lady Gaga told a screaming crowd. The Mother Monster, as she is known, kicked off the show at around 22:10 p.m. local time with her 2011 song \"Bloody Mary.\" Cries of joy rose from the tightly-packed fans who sang and danced shoulder-to-shoulder on the vast stretch of sand. Concert organizers said 2.1 million people attended the show. --- Related Story: [NPR](/nx-s1-5382485) --- Lady Gaga performed her classic hits, including \"Poker Face\" and \"Alejandro,\" switching between an array of dresses including one with the colors of the Brazilian flag. Some fans - many of them young - arrived on the beach at the crack of dawn to secure a good spot, armed with snacks and drinks. They spent the day under a blazing sun, while others perched in trees, determined to get a panoramic view. \"Today is the best day of my life,\" said Manoela Dobes, a 27-year-old designer who was wearing a dress plastered with a photograph from when she met Lady Gaga in the United States in 2019. \"It's surreal to be here.\" Madonna also turned",
    "chunk_id": "url_2dfa4dad_0"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5386457",
    "chunk": "best day of my life,\" said Manoela Dobes, a 27-year-old designer who was wearing a dress plastered with a photograph from when she met Lady Gaga in the United States in 2019. \"It's surreal to be here.\" Madonna also turned Copacabana Beach into a massive dance floor last year. The large-scale performances are part of an effort led by City Hall to boost economic activity after Carnival and New Years' Eve festivities and the upcoming month-long Saint John's Day celebrations in June. \"It brings activity to the city during what was previously considered the low season – filling hotels and increasing spending in bars, restaurants, and retail, generating jobs and income for the population,\" said Osmar Lima, the city's secretary of economic development, in a statement released by Rio City Hall's tourism department last month. Rio's City Hall said in a recent report that the show should inject at least 600 million reais (some $106 million) into Rio's economy. Similar concerts are scheduled to take place every year in May at least until 2028. --- Related Story: [NPR](/nx-s1-5316194) --- Lady Gaga arrived in Rio in the early hours of Tuesday. The city has been alive with Gaga-mania since, as it geared up to welcome the pop star for her first show in the country since 2012. Rio's metro employees danced to Lady Gaga's 2008 hit song \"LoveGame\" and gave instructions for Saturday in a video. A free exhibition celebrating her career sold out. While the vast majority of attendees were from Rio, the event also attracted",
    "chunk_id": "url_2dfa4dad_1"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5386457",
    "chunk": "Rio's metro employees danced to Lady Gaga's 2008 hit song \"LoveGame\" and gave instructions for Saturday in a video. A free exhibition celebrating her career sold out. While the vast majority of attendees were from Rio, the event also attracted Brazilians from across the country and international visitors. More than 500,000 tourists poured into the city in the days leading up to the show, more than double the initial forecast, according to data from the local bus station and Tom Jobim airport, Rio's City Hall said in a statement on Friday. Ingrid Serrano, a 30-year-old engineer, made a cross-continent trip from Colombia to Brazil to attend the show. \"I've been a 100% fan of Lady Gaga my whole life,\" said Serrano, who was wearing a T-shirt featuring Lady Gaga's outlandish costumes over the years. For her, the mega-star represents \"total freedom of expression - being who one wants without shame.\" Rio officials have a history of organizing huge concerts on Copacabana Beach. Madonna's show drew an estimated 1.6 million fans last year, while 4 million people flooded onto the beach for a 1994 New Year's Eve show by Rod Stewart in 1994. According to Guinness World Records, that was the biggest free rock concert in history. To ensure fans could hear the songs, sixteen sound towers were spread along the beach. Rio state's security plan included the presence of 3,300 military and 1,500 police officers, and 400 military firefighters. Among those present were Lady Gaga admirers who remember their disappointment in 2017, when the artist canceled",
    "chunk_id": "url_2dfa4dad_2"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5386457",
    "chunk": "were spread along the beach. Rio state's security plan included the presence of 3,300 military and 1,500 police officers, and 400 military firefighters. Among those present were Lady Gaga admirers who remember their disappointment in 2017, when the artist canceled a performance scheduled in Rio at the last minute due to health issues. Ricardo Filho, who has been a fan since childhood, said it was worth the wait. \"She's the best artist in the world,\" the 25-year-old said, as chants of \"Gaga, I love you\" in Portuguese rose from the crowd behind him. Topics * [News](/1001) * [Culture](/1008) * [Music](/1039) - [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_2dfa4dad_3"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385802",
    "chunk": "Text-Only Version [Go To Full Site](https://www.npr.org/nx-s1-5385802) [NPR](/) > [National](/1003) # Army Black Hawk helicopter forces two jetliners to abort landings at DCA By Greg Allen Saturday, May 3, 2025 • 1:08 PM EDT U.S. Transportation Secretary Sean Duffy says it's \"unacceptable\" that two commercial jetliners had to abort landings this week at Ronald Reagan Washington National Airport because of an Army Black Hawk helicopter. The incident Thursday afternoon occurred three months after 67 people were killed in a [mid-air collision](/2025/03/11/nx-s1-5324543/ntsb-dca-mid-air-collision-american-black-hawk) near the airport between a Black Hawk and a passenger jet. --- Related Story: [NPR](/nx-s1-5324543) --- In an email [reported by Politico](https://www.politico.com/news/2025/05/02/army-helicopter-00324490), Chris Senn, Federal Aviation Administration assistant administrator for government and industry affairs, said the Army helicopter \"took a scenic route around the Pentagon versus proceeding directly from the west to the heliport.\" Senn said the helicopter violated safety standards and required air traffic controllers to order two commercial jetliners to perform \"go-around maneuvers,\" aborting their landings and returning on another approach. Restrictions were placed on [helicopter flights](/2025/01/31/g-s1-45821/faa-restricts-helicopter-flights-dca-airport) near the airport after a Jan. 29 mid-air collision between a Black Hawk helicopter and an American Airlines regional jet that was [attempting to land](/2025/01/30/nx-s1-5280403/map-plane-helicopter-crash-washington-dc) at DCA. It was the deadliest aviation accident in the U.S. since 2001. \"Unacceptable. Our helicopter restrictions around DCA are crystal clear,\" Duffy [said in a post](https://x.com/SecDuffy/status/1918448336048206226) on the social platform X. \"Safety must ALWAYS come first. We just lost 67 souls! No more helicopter rides for VIPs or unnecessary training in a congested DCA airspace full of civilians.\" --- Related Story:",
    "chunk_id": "url_a11f4480_0"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385802",
    "chunk": "Duffy [said in a post](https://x.com/SecDuffy/status/1918448336048206226) on the social platform X. \"Safety must ALWAYS come first. We just lost 67 souls! No more helicopter rides for VIPs or unnecessary training in a congested DCA airspace full of civilians.\" --- Related Story: [NPR](/nx-s1-5344430) --- The FAA said the incident, which happened around 2:30 p.m. on Thursday, involved a Delta Air Lines flight and a Republic Airways flight. The FAA and the National Transportation Safety Board are both carrying out investigations. Duffy said he'll also be talking to officials at the Defense Department about \"why the hell our rules were disregarded.\" In March, following the release of a preliminary investigation report into the January crash, NTSB Chairwoman Jennifer Homendy described the flight patterns around DCA as [\"an intolerable risk\"](/2025/03/11/nx-s1-5324543/ntsb-dca-mid-air-collision-american-black-hawk) as helicopters and commercial planes operate close to each other in the busy airspace over Washington. An NTSB analysis found that from 2011 to 2024, there was at least one \"close call\" each month between a commercial plane operating at the airport and a helicopter, she said. Duffy permanently restricted non-essential helicopter operations around DCA. In late March, [a close call](/2025/03/29/nx-s1-5344430/delta-plane-dca-close-call-air-force) between a Delta plane and an Air Force jet outside Washington triggered a collision warning and \"corrective instructions\" from air traffic controllers. Topics * [News](/1001) * [Culture](/1008) * [Music](/1039) - [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_a11f4480_1"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385802",
    "chunk": "- [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_a11f4480_2"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384790",
    "chunk": "Text-Only Version [Go To Full Site](https://www.npr.org/nx-s1-5384790) [NPR](/) > [Media](/1020) # Trump says he's ending federal funding for NPR and PBS. They say he can't By David Folkenflik Updated Friday, May 2, 2025 • 10:57 AM EDT President Trump issued an executive order late Thursday directing the Corporation for Public Broadcasting's board of directors to \"cease federal funding for NPR and PBS,\" the nation's primary public broadcasters, claiming ideological bias. \"Neither entity presents a fair, accurate or unbiased portrayal of current events to tax-paying citizens,\" the order says. \"The CPB Board shall cancel existing direct funding to the maximum extent allowed by law and shall decline to provide future funding.\" It is not clear that the president has the authority to make such orders to CPB under the law. PBS President and CEO Paula Kerger called it a \"blatantly unlawful Executive Order, issued in the middle of the night.\" CPB is [already suing](/2025/04/29/nx-s1-5381045/cpb-board-members-trump-lawsuit-npr-pbs) the Trump administration over his executive order seeking to fire three of its five board members; on Friday, it dismissed the validity of the president's new order. \"CPB is not a federal executive agency subject to the President's authority,\" the corporation wrote in a statement issued Friday morning. \"Congress directly authorized and funded CPB to be a private nonprofit corporation wholly independent of the federal government.\" The CPB noted that the statute Congress passed to create it \"expressly forbade 'any department, agency, officer, or employee of the United States to exercise any direction, supervision, or control over educational television or radio broadcasting, or over",
    "chunk_id": "url_be2b6ba8_0"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384790",
    "chunk": "federal government.\" The CPB noted that the statute Congress passed to create it \"expressly forbade 'any department, agency, officer, or employee of the United States to exercise any direction, supervision, or control over educational television or radio broadcasting, or over [CPB] or any of its grantees or contractors.\" Congress said that such funds \"may be used at the discretion of the recipient\" for producing or acquiring programs to put on the air. Trump's newest order appears to envision a continuation of federal subsidies for public radio and television stations — apart from NPR and PBS. It is unclear how that squares with Trump's pledge to [ask Congress to rescind](/2025/04/15/nx-s1-5352827/npr-pbs-public-media-trump-rescission-funding) all funds already approved for public broadcasting. --- Related Story: [NPR](/nx-s1-5381045) --- Congress allocates federal funding for CPB and specifies how it shall be spent. The funding is carried out in two-year cycles, ahead of time, a structure designed to help shield public media from political pressure. Trump, by contrast, has waged rhetorical warfare against it, fueling and channeling his supporters' distrust of traditional newsgathering. On social media platforms, Trump recently [blasted](https://truthsocial.com/%40realDonaldTrump/114264549657133828) the two national public broadcasting networks, posting in all caps: \"REPUBLICANS MUST DEFUND AND TOTALLY DISASSOCIATE THEMSELVES FROM NPR & PBS, THE RADICAL LEFT 'MONSTERS' THAT SO BADLY HURT OUR COUNTRY!\" NPR vowed to fight back in a statement released Friday by Heather Walls, its senior vice president of communications. \"We will vigorously defend our right to provide essential news, information and life-saving services to the American public,\" NPR [said](/2025/05/02/g-s1-64016/npr-statement-on-white-house-executive-order) in the statement. \"The President's",
    "chunk_id": "url_be2b6ba8_1"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384790",
    "chunk": "back in a statement released Friday by Heather Walls, its senior vice president of communications. \"We will vigorously defend our right to provide essential news, information and life-saving services to the American public,\" NPR [said](/2025/05/02/g-s1-64016/npr-statement-on-white-house-executive-order) in the statement. \"The President's order is an affront to the First Amendment rights of NPR and locally owned and operated stations throughout America to produce and air programming that meets the needs of their communities.\" It said the executive order jeopardizes the national airing of NPR newscasts, and programs like *Morning Edition* and *Tiny Desk Radio*. ### Accusations of political bias The leaders of NPR and PBS [testified at a House oversight committee hearing](/2025/03/26/nx-s1-5339951/npr-pbs-congress-hearing) in March on allegations of ideological bias in public broadcasting. Republican lawmakers assailed NPR President and CEO Katherine Maher for political messages she had posted to social media years before she joined NPR in March 2024, as well as news decisions the network made largely before her tenure. PBS' Kerger found herself queried about a video involving a performer in drag singing a variation on a children's song for a young audience. (Kerger testified that the video was posted on the website of PBS' New York City member station and never aired on television.) Earlier this week, the Federal Election Commission [unanimously dismissed](https://www.fec.gov/files/legal/murs/8328/8328_10.pdf) a complaint of bias and illegal electioneering against NPR, finding that the network is engaged in a \"legitimate press function.\" ### How federal funds reach NPR and PBS Federal funding for public media flows through the congressionally chartered Corporation for Public Broadcasting. Congress",
    "chunk_id": "url_be2b6ba8_2"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384790",
    "chunk": "bias and illegal electioneering against NPR, finding that the network is engaged in a \"legitimate press function.\" ### How federal funds reach NPR and PBS Federal funding for public media flows through the congressionally chartered Corporation for Public Broadcasting. Congress allocated $535 million for the CPB for the current fiscal year — an amount affirmed in a recent stop-gap bill passed by the Republican-controlled U.S. House and Senate. According to the Corporation for Public Broadcasting, Congress has fully funded it through Sept 30, 2027. At the hearing in late March, heads of both networks spoke of the mission to provide nonpartisan news and programming to the American public, without charge. They said stations would be most vulnerable if federal funding was cut off for public broadcasting. --- Related Story: [NPR](/nx-s1-5366040) --- NPR typically receives about 1% of its funding directly from the federal government, and a slightly greater amount indirectly; its 246 member institutions, operating more than 1,000 stations, receive on average 8% to 10% of their funds from CPB. By contrast, PBS and its stations receive about 15% of their revenues from CPB's federal funds. Most of the funds for public media go to local stations; and most to subsidize television, which is more expensive than radio. ### A government investigation of public broadcasters The Trump administration's assault on public media began just weeks after his inauguration. Trump's appointee as the nation's chief broadcast regulator, Federal Communications Commission Chairperson Brendan Carr, launched an investigation of NPR and PBS, contending it appears that their corporate underwriting",
    "chunk_id": "url_be2b6ba8_3"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384790",
    "chunk": "Trump administration's assault on public media began just weeks after his inauguration. Trump's appointee as the nation's chief broadcast regulator, Federal Communications Commission Chairperson Brendan Carr, launched an investigation of NPR and PBS, contending it appears that their corporate underwriting spots violate laws banning commercial advertisements. Carr has used it to question federal funding of the networks and their non-commercial status. The networks say they have been encouraged repeatedly by the agency and Congress to develop private financial support and have worked assiduously for years with the FCC to ensure that content falls within FCC guidelines. PBS offers a heavy amount of educational fare; NPR relies more on news and music. Both provide locally grounded content and reach more than 99% of the population, at no cost. In many states and communities, the stations also serve as a key component of emergency and disaster response systems. While the CPB is suing the Trump administration over the attempted firings of three of the five board members, were Trump to succeed in doing so, it would appear he would have, for now, erased the quorum necessary for the CPB board to take any actions. That includes, presumably, the elimination of funds for PBS and NPR. *Disclosure: This story was reported and written by NPR Media Correspondent David Folkenflik and edited by Deputy Business Editor Emily Kopp, Managing Editor Gerry Holmes and Managing Editor Vickie Walton-James. Under NPR's protocol for reporting on itself, no corporate official or news executive reviewed this story before it was posted publicly.* --- ###",
    "chunk_id": "url_be2b6ba8_4"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5384790",
    "chunk": "and edited by Deputy Business Editor Emily Kopp, Managing Editor Gerry Holmes and Managing Editor Vickie Walton-James. Under NPR's protocol for reporting on itself, no corporate official or news executive reviewed this story before it was posted publicly.* --- ### CORRECTION May. 2nd, 2025 We previously stated NPR's 246 member organizations operate 1,300 public radio stations altogether. In fact, NPR member organizations operate 1,024 public radio stations across the country. We have updated our stories. Topics * [News](/1001) * [Culture](/1008) * [Music](/1039) - [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_be2b6ba8_5"
  },
  {
    "doc": "https://text.npr.org/",
    "chunk": "Text-Only Version [Go To Full Site](https://www.npr.org/) # NPR : National Public Radio Sunday, May 4, 2025 * [Sweeping cuts hit NEA after Trump administration calls to eliminate the agency](/nx-s1-5385888) * [Warren Buffett announces his retirement and warns the trade war will hurt America](/nx-s1-5384958) * [How this teen fled Russian occupation to become an unassuming hero in Ukraine](/nx-s1-5348841) * [How Palantir, the secretive tech company, is rising in the Trump era](/nx-s1-5372776) * [Army Black Hawk helicopter forces two jetliners to abort landings at DCA](/nx-s1-5385802) * [Sovereignty beats out favorite Journalism to win the Kentucky Derby](/nx-s1-5385847) * [The Vatican installs chimney to signal the selection of the next pope](/nx-s1-5385869) * [Australia's Prime Minister Anthony Albanese heads to a second 3-year term](/g-s1-64181) * [Houthi missile strike at Israel airport halts flights ahead of key vote on Gaza war](/g-s1-64233) * [Trump says he's ending federal funding for NPR and PBS. They say he can't](/nx-s1-5384790) * [Lady Gaga rocks Copacabana Beach with a free concert for more than 2 million fans](/nx-s1-5386457) * [Mexico's president says she rejected Trump's plan to send US troops across the border](/nx-s1-5386456) * [A telescope's powerful new tool may offer a better way to predict solar storms](/nx-s1-5385776) * [Captive-bred axolotls thrive in Mexican wetlands, researchers find](/nx-s1-5384941) * [Actress and 'Laugh-In' comedian Ruth Buzzi dies at 88](/nx-s1-5385844) * [Medical journals hit with threatening letters from Justice Department](/nx-s1-5374993) * [This 'Time icon' of 2025 is serious about her work — and funny enough to do stand up](/g-s1-62501) * [Federal judge strikes down Trump order targeting the law firm Perkins",
    "chunk_id": "url_ef102425_0"
  },
  {
    "doc": "https://text.npr.org/",
    "chunk": "[Medical journals hit with threatening letters from Justice Department](/nx-s1-5374993) * [This 'Time icon' of 2025 is serious about her work — and funny enough to do stand up](/g-s1-62501) * [Federal judge strikes down Trump order targeting the law firm Perkins Coie](/nx-s1-5385355) * [If you're a military veteran at risk of foreclosure, NPR wants to hear from you](/1212408194) * [Trump's VA strands thousands of veterans by ending a key mortgage program](/nx-s1-5382448) Topics * [News](/1001) * [Culture](/1008) * [Music](/1039) - [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_ef102425_1"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385888",
    "chunk": "Text-Only Version [Go To Full Site](https://www.npr.org/nx-s1-5385888) [NPR](/) > [Culture](/1008) # Sweeping cuts hit NEA after Trump administration calls to eliminate the agency By Chloe Veltman Saturday, May 3, 2025 • 9:58 PM EDT The Trump Administration has started canceling National Endowment for the Arts (NEA) grants. Hundreds of arts groups of various sizes across the U.S. received emails notifying them of the withdrawal and termination of their grants late on Friday. The updates, which came from a generic \"arts.gov\" email address, appeared in grantees' inboxes just hours after President Trump proposed eliminating the agency entirely from the federal budget. Among those affected are the Berkeley Repertory Theater, Central Park Summer Stage in New York City, and the Chicago-area arts education nonprofit Open Studio Project. \"The NEA is updating its grantmaking policy priorities to focus funding on projects that reflect the nation's rich artistic heritage and creativity as prioritized by the President,\" the email, several copies of which have been shared with NPR, stated in part. \"Consequently, we are terminating awards that fall outside these new priorities.\" The email includes a line saying the recipient can appeal the decision within seven days. The email states President Trump's priorities as being: \"Projects that elevate the Nation's HBCUs and Hispanic Serving Institutions, celebrate the 250th anniversary of American independence, foster AI competency, empower houses of worship to serve communities, assist with disaster recovery, foster skilled trade jobs, make America healthy again, support the military and veterans, support Tribal communities, make the District of Columbia safe and beautiful, and support",
    "chunk_id": "url_38e9e320_0"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385888",
    "chunk": "foster AI competency, empower houses of worship to serve communities, assist with disaster recovery, foster skilled trade jobs, make America healthy again, support the military and veterans, support Tribal communities, make the District of Columbia safe and beautiful, and support the economic development of Asian American communities.\" The NEA did not respond to requests for comment. But arts groups have been vocal about the cuts on social media, in online newsletters and in emails to NPR. \"The work will go on, but right now I'm pretty discouraged,\" wrote Rob Lentz, executive director at Open Studio Project, on [LinkedIn](https://www.linkedin.com/feed/update/urn%3Ali%3Aactivity%3A7324463239587581953/). Lentz said his organization's two-year grant supporting art for elementary school students has been canceled. \"The nonprofit sector is under siege by our own government, and arts organizations are especially vulnerable. When chaos and cruelty are the order of the day, all I can ask for is solidarity and resistance.\" [Studio Two Three](https://www.studiotwothree.org/), a community arts space in Richmond, Va., shared information about a canceled $30,000 grant. \"Absolutely furious,\" wrote Kate Fowler, the organization's director of community partnerships and development, on [Instagram](https://www.instagram.com/p/DJLNAtANYjD/?igsh=Mzc3ZTVlOWMwZA%3D%3D): \"A grant we spent hours (days?) writing, submitted on time, were selected and approved for by a group of our national peers and received our acceptance letter for, was randomly revoked today. It is WILD that this administration is retroactively pulling funding.\" Meanwhile, Los Angeles-based [Cornerstone Theater Company](https://cornerstonetheater.org/)'s grant offer worth $40,000 has been withdrawn. In an email to NPR, Megan Wanlass and Sunder Ganglani, the company's managing and artistic directors, said, \"The grant was intended",
    "chunk_id": "url_38e9e320_1"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385888",
    "chunk": "this administration is retroactively pulling funding.\" Meanwhile, Los Angeles-based [Cornerstone Theater Company](https://cornerstonetheater.org/)'s grant offer worth $40,000 has been withdrawn. In an email to NPR, Megan Wanlass and Sunder Ganglani, the company's managing and artistic directors, said, \"The grant was intended to support our ongoing investigation into the relationship between theater and the history and practice of American democracy — a project that we believe is a rigorous inquiry into American Independence — one of the NEA's changed funding priorities.\" The NEA apparently disagrees. Its email, shared by Cornerstone with NPR, states that the grant was withdrawn for not aligning with the agency's priority, \"to support the development and production of community-engaged, devised work.\" Beyond the wave of cuts, the National Endowment for the Arts is among a group of \"small agency eliminations\" proposed by the Trump administration's [2026 Discretionary Budget Request](https://whitehouse.gov/wp-content/uploads/2025/05/Fiscal-year-2026-discretionary-budget-request.pdf), alongside the National Endowment for the Humanities and the Institute of Museum and Library Services. \"The Budget includes the elimination of, or the elimination of Federal funding for, the following small agencies — consistent with the President's efforts to decrease the size of the Federal Government to enhance accountability, reduce waste, and reduce unnecessary governmental entities. Past Trump administration budgets have also supported these eliminations. Remaining funds account for costs of orderly shutdowns,\" the budget request states. Since its founding by Congress in 1965, the National Endowment for the Arts has awarded $5.5 billion in grants. It is the largest arts funder in the U.S. — yet one of the smallest federal agencies. It is",
    "chunk_id": "url_38e9e320_2"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385888",
    "chunk": "request states. Since its founding by Congress in 1965, the National Endowment for the Arts has awarded $5.5 billion in grants. It is the largest arts funder in the U.S. — yet one of the smallest federal agencies. It is currently [funded](https://www.arts.gov/about/appropriations-history) at $207 million, which represents a tiny fraction of the overall budget. According to an NEA [fact sheet](https://www.arts.gov/sites/default/files/NEA-Quick-Facts-8.9.22-two-pager.pdf) from 2022, the agency's funding amounts to 0.003% of the total federal budget. Republican administrations have called for its reduction and closure in the past, including during the first Trump presidency. However, the agency has historically received wide bi-partisan support because, as its [website states](https://www.arts.gov/impact), it \"supports arts organizations and artists in every congressional district in the country.\" The grant cuts and proposed agency elimination have drawn wide criticism across the cultural spectrum. Eliminating the endowment itself would take a majority in Congress. \"Any attempt to dismantle the National Endowment for the Arts — by eliminating funding, reducing staff, or canceling grants — is deeply concerning, shortsighted, and detrimental to our nation,\" said Erin Harkey, CEO of the national arts advocacy organization [Americans for the Arts](https://www.americansforthearts.org/), in a statement shared with NPR. \"The NEA plays a vital role in the lives of millions of Americans and the thousands of nonprofit and governmental arts and cultural organizations that bring America's story to life.\" Al Vincent, Jr., executive director of [Actors' Equity Association](https://www.actorsequity.org/news/PR/NEABudgetThreatened2025/), said: \"Federal arts funding survived the last Trump Administration with bipartisan support because Congress understands that the live arts are a huge economic job creator",
    "chunk_id": "url_38e9e320_3"
  },
  {
    "doc": "https://text.npr.org/nx-s1-5385888",
    "chunk": "that bring America's story to life.\" Al Vincent, Jr., executive director of [Actors' Equity Association](https://www.actorsequity.org/news/PR/NEABudgetThreatened2025/), said: \"Federal arts funding survived the last Trump Administration with bipartisan support because Congress understands that the live arts are a huge economic job creator across the country.\" \"We will fight to protect this critical funding that generates a huge return on investment in local communities,\" he added. Bob Suttmann, president of [AFM Local 802](https://www.local802afm.org/), the musicians union in New York, said, \"This is a dark day for the independence of the arts and musicians across the country — and it is an attack on American excellence and creativity.\" Topics * [News](/1001) * [Culture](/1008) * [Music](/1039) - [Contact Us](/614470770) - [Terms of Use](/179876898) - [Permissions](/179881519) - [Privacy Policy](/179878450) © NPR",
    "chunk_id": "url_38e9e320_4"
  }
]